## import library

In [19]:
import pandas as pd
import matplotlib as plt

<h2>1. Datatypes</h2>
pandas has two main datatypes, Series and DataFrame.
<ul>    
    <li>Series - a 1-dimensional column of data.DataFrame (most common) - a</li> 
    <li>2-dimesional table of data with rows and columns.</li>
</ul>    
You can create a Series using pd.Series() and passing it a Python list.

In [20]:
# Creating a series of car types
cars = pd.Series(['BMW','Carolla','Audi','Aqua'])
cars

0        BMW
1    Carolla
2       Audi
3       Aqua
dtype: object

In [21]:
# Creating a series of colours
colurs = pd.Series(['Red','Green','Blue','Yellow'])
colurs

0       Red
1     Green
2      Blue
3    Yellow
dtype: object

In [22]:
# Creating a series of colours
price = pd.Series(['150000','2100000','2300910','5667329'])
price

0     150000
1    2100000
2    2300910
3    5667329
dtype: object

In [23]:
df = pd.DataFrame({"car_name":cars,"car_color":colurs,"price":price})
df

  car_name car_color    price
0      BMW       Red   150000
1  Carolla     Green  2100000
2     Audi      Blue  2300910
3     Aqua    Yellow  5667329

### import csv file

In [24]:
df = pd.read_csv('..\data\car-sales.csv',encoding='utf-8')

In [61]:
df

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4   4,000.00
1   Honda    Red          87899      4   5,000.00
2  Toyota   Blue          32549      3   7,000.00
3     BMW  Black          11179      5  22,000.00
4  Nissan  White         213095      4   3,500.00
5  Toyota  Green          99213      4   4,500.00
6   Honda   Blue          45698      4   7,500.00
7   Honda   Blue          54738      4   7,000.00
8  Toyota  White          60000      4   6,250.00
9  Nissan  White          31600      4   9,700.00

In [26]:
print(df['Price'])

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [27]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Dollar Sign in Price table

In [28]:
df['Price'] = list(map(lambda x:x[1:],df['Price'].values))

In [29]:
df

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4   4,000.00
1   Honda    Red          87899      4   5,000.00
2  Toyota   Blue          32549      3   7,000.00
3     BMW  Black          11179      5  22,000.00
4  Nissan  White         213095      4   3,500.00
5  Toyota  Green          99213      4   4,500.00
6   Honda   Blue          45698      4   7,500.00
7   Honda   Blue          54738      4   7,000.00
8  Toyota  White          60000      4   6,250.00
9  Nissan  White          31600      4   9,700.00

## export file in the form of csv

In [12]:
df.to_csv('lahore.csv',index = False)

## import csv file

In [39]:
df1 =  pd.read_csv('../data/car-sales-missing-data.csv',encoding='utf-8')

In [40]:
df1

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [41]:
df1['Price'].fillna(0)

0     $4,000
1     $5,000
2     $7,000
3    $22,000
4     $3,500
5     $4,500
6     $7,500
7          0
8          0
9     $9,700
Name: Price, dtype: object

In [45]:
df1['Price'].astype(str)
type(df1['Price'])

pandas.core.series.Series

In [56]:
df1['new_price'] = df1['Price'] + '.00'

In [72]:
df1.dtypes

Make          object
Colour        object
Odometer     float64
Doors        float64
Price         object
new_price     object
dtype: object

In [73]:
df1.columns

Index(['Make', 'Colour', 'Odometer', 'Doors', 'Price', 'new_price'], dtype='object')

In [74]:
df1

     Make Colour  Odometer  Doors    Price   new_price
0  Toyota  White  150043.0    4.0   $4,000   $4,000.00
1   Honda    Red   87899.0    4.0   $5,000   $5,000.00
2  Toyota   Blue       NaN    3.0   $7,000   $7,000.00
3     BMW  Black   11179.0    5.0  $22,000  $22,000.00
4  Nissan  White  213095.0    4.0   $3,500   $3,500.00
5  Toyota  Green       NaN    4.0   $4,500   $4,500.00
6   Honda    NaN       NaN    4.0   $7,500   $7,500.00
7   Honda   Blue       NaN    4.0      NaN         NaN
8  Toyota  White   60000.0    NaN      NaN         NaN
9     NaN  White   31600.0    4.0   $9,700   $9,700.00

In [75]:
df1.describe()

            Odometer  Doors
count       6.000000    9.0
mean    92302.666667    4.0
std     76489.805168    0.5
min     11179.000000    3.0
25%     38700.000000    4.0
50%     73949.500000    4.0
75%    134507.000000    4.0
max    213095.000000    5.0

In [76]:
df1.mean()

Odometer    92302.666667
Doors           4.000000
dtype: float64

In [79]:
df1.median()

Odometer    73949.5
Doors           4.0
dtype: float64

In [80]:
df1.mode()

     Make Colour  Odometer  Doors    Price   new_price
0  Toyota  White   11179.0    4.0  $22,000  $22,000.00
1     NaN    NaN   31600.0    NaN   $3,500   $3,500.00
2     NaN    NaN   60000.0    NaN   $4,000   $4,000.00
3     NaN    NaN   87899.0    NaN   $4,500   $4,500.00
4     NaN    NaN  150043.0    NaN   $5,000   $5,000.00
5     NaN    NaN  213095.0    NaN   $7,000   $7,000.00
6     NaN    NaN       NaN    NaN   $7,500   $7,500.00
7     NaN    NaN       NaN    NaN   $9,700   $9,700.00

In [81]:
df1['Doors'].sum()

36.0

In [82]:
df1.head()

     Make Colour  Odometer  Doors    Price   new_price
0  Toyota  White  150043.0    4.0   $4,000   $4,000.00
1   Honda    Red   87899.0    4.0   $5,000   $5,000.00
2  Toyota   Blue       NaN    3.0   $7,000   $7,000.00
3     BMW  Black   11179.0    5.0  $22,000  $22,000.00
4  Nissan  White  213095.0    4.0   $3,500   $3,500.00

In [83]:
df1.tail()

     Make Colour  Odometer  Doors   Price  new_price
5  Toyota  Green       NaN    4.0  $4,500  $4,500.00
6   Honda    NaN       NaN    4.0  $7,500  $7,500.00
7   Honda   Blue       NaN    4.0     NaN        NaN
8  Toyota  White   60000.0    NaN     NaN        NaN
9     NaN  White   31600.0    4.0  $9,700  $9,700.00

In [87]:
pd.crosstab(df1['Make'],df1['Doors'])

Doors  3.0  4.0  5.0
row_0
Make     1    7    1

In [89]:
df1.groupby(['Make']).mean()

        Odometer     Doors
Make
BMW      11179.0  5.000000
Honda    87899.0  4.000000
Nissan  213095.0  4.000000
Toyota  105021.5  3.666667